# RectangularDuctSizeSuffix Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSettings..::..RectangularDuctSizeSuffix Property
DuctSettings Class See Also
---
The rectangular duct size suffix string.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string RectangularDuctSizeSuffix { get; set; }
```

Visual Basic
---
```text
Public Property RectangularDuctSizeSuffix As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ RectangularDuctSizeSuffix {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace